# CmCaret2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..CmCaret2 Property
SymbolTypeId Class See Also
---
Symbol cm^2, indicating unit Square centimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CmCaret2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CmCaret2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CmCaret2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace